---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.MembersMovedToProjectToMakeConsistent
source: html/f5580dc8-f653-d347-0c71-e164b04a96dc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.MembersMovedToProjectToMakeConsistent Property

Group members had to be "moved to the project" (removed from their group instance) because they were not consistent
 with the group type definition.

## Syntax (C#)
```csharp
public static FailureDefinitionId MembersMovedToProjectToMakeConsistent { get; }
```